---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.EnterNonNegativeValue
source: html/ccb854d5-15a3-8ceb-f569-6a111bb80b5a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.EnterNonNegativeValue Property

Enter a non-negative value.

## Syntax (C#)
```csharp
public static FailureDefinitionId EnterNonNegativeValue { get; }
```